// Задача 13: Напишите программу, которая выводит третью цифру заданного числа или сообщает, что третьей цифры нет. (Цифры считать справа налево).

Console.Clear();
Console.WriteLine("Введите любое число: ");
string num = (Console.ReadLine()!);
